In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("C:\\Users\\AKASH\\Downloads\\data_dev_script.csv")

In [2]:
schema_df = pd.read_csv("C:\\Users\\AKASH\\Downloads\\survey_results_schema.csv")

In [17]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [18]:
df1 = pd.DataFrame(people)

In [19]:
df1.columns

Index(['first', 'last', 'email'], dtype='object')

In [20]:
df1.columns = ['first_name' , 'last_name' , "email"]

In [21]:
df1

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [22]:
df1.loc[2] = ['John' , "Smith" , "JohnSmith@email.com"]

In [23]:
df1

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John     Smith      JohnSmith@email.com

In [24]:
df1.loc[2 , ['last_name' , 'email']] = ["Doe" , "Johndoe@email.com"]
df1

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        Johndoe@email.com

In [25]:
df1.loc[2 , "last_name"] = "Smith"

In [26]:
df1

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John     Smith        Johndoe@email.com

In [27]:
df1.loc[2 , "last_name"] = "Doe"

In [29]:
df1.at[2 , "last_name"] = "Smith"
df1

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John     Smith        Johndoe@email.com

In [31]:
df1.loc[2 , "last_name"] = "Doe"
df1

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        Johndoe@email.com

In [47]:
filt = (df1['email'] == 'Johndoe@email.com')

In [48]:
df1[filt]['last_name'] = "smith"

C:\Users\AKASH\AppData\Local\Temp\ipykernel_2688\3001514020.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1[filt]['last_name'] = "smith"

In [49]:
df1

  first_name last_name                    email last
0      Corey   Schafer  CoreyMSchafer@gmail.com  NaN
1       Jane       Doe        JaneDoe@email.com  NaN
2       John       Doe        Johndoe@email.com  NaN

In [50]:
df1.loc[filt , 'last_name'] = "smith"

In [51]:
df1

  first_name last_name                    email last
0      Corey   Schafer  CoreyMSchafer@gmail.com  NaN
1       Jane       Doe        JaneDoe@email.com  NaN
2       John     smith        Johndoe@email.com  NaN

In [52]:
df1['email'].str.lower()

0    coreymschafer@gmail.com
1          janedoe@email.com
2          johndoe@email.com
Name: email, dtype: object

In [53]:
df1['email'] = df1['email'].str.lower()

In [55]:
df1

  first_name last_name                    email last
0      Corey   Schafer  coreymschafer@gmail.com  NaN
1       Jane       Doe        janedoe@email.com  NaN
2       John     smith        johndoe@email.com  NaN

In [57]:
df1['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [59]:
def update_email(email):
    return email.upper()

In [60]:
df1['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [65]:
del df1['last']

In [67]:
df1.applymap(len)

   first_name  last_name  email
0           5          7     23
1           4          3     17
2           4          5     17

In [68]:
df1.applymap(str.lower)

  first_name last_name                    email
0      corey   schafer  coreymschafer@gmail.com
1       jane       doe        janedoe@email.com
2       john     smith        johndoe@email.com

In [69]:
df.head(2)

,Respondent,MainBranch,Hobbyist,OpenSourcer,OpenSource,Employment,Country,Student,EdLevel,UndergradMajor,...,WelcomeChange,SONewContent,Age,Gender,Trans,Sexuality,Ethnicity,Dependents,SurveyLength,SurveyEase
0,1,I am a student who is learning to code,Yes,Never,The quality of OSS and closed source software ...,"Not employed, and not looking for work",United Kingdom,No,Primary/elementary school,NaN,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,14.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
1,2,I am a student who is learning to code,No,Less than once per year,The quality of OSS and closed source software ...,"Not employed, but looking for work",Bosnia and Herzegovina,"Yes, full-time","Secondary school (e.g. American high school, G...",NaN,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,19.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult

In [70]:
schema_df.head(2)

       Column                                       QuestionText
0  Respondent  Randomized respondent ID number (not in order ...
1  MainBranch  Which of the following options best describes ...

In [72]:
df.rename(columns={"ConvertedComp" : "SalaryUSD"} , inplace = True)

In [73]:
df['Hobbyist']

0        Yes
1         No
2        Yes
3         No
4        Yes
        ...
88878    Yes
88879     No
88880     No
88881     No
88882    Yes
Name: Hobbyist, Length: 88883, dtype: object

In [74]:
df['Hobbyist'] = df['Hobbyist'].map({"Yes" : True , "No" : False})

In [75]:
df['Hobbyist']

0         True
1        False
2         True
3        False
4         True
         ...
88878     True
88879    False
88880    False
88881    False
88882     True
Name: Hobbyist, Length: 88883, dtype: bool